test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
            testname="JSONPlaceholder Fixed Test Plan" enabled="true">
            <boolProp name="TestPlan.functional_mode">false</boolProp>
            <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
            <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables"
                enabled="true">
                <collectionProp name="Arguments.arguments" />
            </elementProp>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group"
                enabled="true">
                <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
                <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                    guiclass="LoopControlPanel" testclass="LoopController"
                    testname="Loop Controller" enabled="true">
                    <boolProp name="LoopController.continue_forever">false</boolProp>
                    <stringProp name="LoopController.loops">3</stringProp>
                </elementProp>
                <stringProp name="ThreadGroup.num_threads">5</stringProp>
                <stringProp name="ThreadGroup.ramp_time">10</stringProp>
                <boolProp name="ThreadGroup.scheduler">false</boolProp>
                <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
            </ThreadGroup>
            <hashTree>
                <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                    testname="HTTP Header Manager" enabled="true">
                    <collectionProp name="HeaderManager.headers">
                        <elementProp name="" elementType="Header">
                            <stringProp name="Header.name">Content-type</stringProp>
                            <stringProp name="Header.value">application/json; charset=UTF-8</stringProp>
                        </elementProp>
                    </collectionProp>
                </HeaderManager>
                <hashTree />

                <!-- GET Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="GET Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <stringProp name="HTTPSampler.method">GET</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="49586">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="1539">userId</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                        testname="Assert Duration" enabled="true">
                        <stringProp name="DurationAssertion.duration">2000</stringProp>
                    </DurationAssertion>
                    <hashTree />
                </hashTree>

                <!-- POST Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="POST Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts</stringProp>
                    <stringProp name="HTTPSampler.method">POST</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <stringProp name="Argument.value">{"title": "foo", "body": "bar",
                                    "userId": 1}</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 201" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="49587">201</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="110371416">title</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                        testname="Assert Duration" enabled="true">
                        <stringProp name="DurationAssertion.duration">2000</stringProp>
                    </DurationAssertion>
                    <hashTree />
                </hashTree>

                <!-- PUT Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="PUT Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <stringProp name="HTTPSampler.method">PUT</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <stringProp name="Argument.value">{"id": 1, "title": "foo", "body":
                                    "bar", "userId": 1}</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="49586">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="3355">id</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                        testname="Assert Duration" enabled="true">
                        <stringProp name="DurationAssertion.duration">2000</stringProp>
                    </DurationAssertion>
                    <hashTree />
                </hashTree>

                <!-- PATCH Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="PATCH Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <stringProp name="HTTPSampler.method">PATCH</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                    <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
                    <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
                        <collectionProp name="Arguments.arguments">
                            <elementProp name="" elementType="HTTPArgument">
                                <stringProp name="Argument.value">{"title": "changed"}</stringProp>
                                <stringProp name="Argument.metadata">=</stringProp>
                            </elementProp>
                        </collectionProp>
                    </elementProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="49586">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="110371416">title</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                        testname="Assert Duration" enabled="true">
                        <stringProp name="DurationAssertion.duration">2000</stringProp>
                    </DurationAssertion>
                    <hashTree />
                </hashTree>

                <!-- DELETE Request -->
                <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                    testname="DELETE Request" enabled="true">
                    <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
                    <stringProp name="HTTPSampler.protocol">https</stringProp>
                    <stringProp name="HTTPSampler.path">/posts/1</stringProp>
                    <stringProp name="HTTPSampler.method">DELETE</stringProp>
                    <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
                </HTTPSamplerProxy>
                <hashTree>
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Code 200" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="49586">200</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
                        <intProp name="Assertion.test_type">8</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                        testname="Assert Body Text" enabled="true">
                        <collectionProp name="Asserion.test_strings">
                            <stringProp name="123">{</stringProp>
                        </collectionProp>
                        <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
                        <intProp name="Assertion.test_type">2</intProp>
                    </ResponseAssertion>
                    <hashTree />
                    <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion"
                        testname="Assert Duration" enabled="true">
                        <stringProp name="DurationAssertion.duration">2000</stringProp>
                    </DurationAssertion>
                    <hashTree />
                </hashTree>

            </hashTree>
        </hashTree>
    </hashTree>
</jmeterTestPlan>