logs/jmeter-1785439765624.log
2026-07-30 22:33:32,179 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-07-30 22:33:32,198 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2026-07-30 22:33:32,198 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2026-07-30 22:33:32,198 INFO o.a.j.JMeter: Setting JMeter property: jmeter.save.saveservice.output_format=xml
2026-07-30 22:33:32,198 INFO o.a.j.JMeter: Setting JMeter property: jmeter.save.saveservice.response_data=true
2026-07-30 22:33:32,199 INFO o.a.j.JMeter: Setting JMeter property: jmeter.save.saveservice.samplerData=true
2026-07-30 22:33:32,199 INFO o.a.j.JMeter: Setting JMeter property: jmeter.save.saveservice.requestHeaders=true
2026-07-30 22:33:32,199 INFO o.a.j.JMeter: Setting JMeter property: jmeter.save.saveservice.responseHeaders=true
2026-07-30 22:33:32,199 INFO o.a.j.JMeter: Setting JMeter property: jmeter.save.saveservice.assertion_results_failure_message=true
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: Version 5.6.3
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: java.version=21.0.12
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: os.name=Mac OS X
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: os.arch=aarch64
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: os.version=26.5.2
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: java.awt.headless=true
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: Max memory     =1073741824
2026-07-30 22:33:32,203 INFO o.a.j.JMeter: Available Processors =8
2026-07-30 22:33:32,213 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-07-30 22:33:32,213 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-07-30 22:33:32,213 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2026-07-30 22:33:32,213 INFO o.a.j.JMeter: user.dir  =/Users/anatoliy/MyProject
2026-07-30 22:33:32,213 INFO o.a.j.JMeter: PWD       =/Users/anatoliy/MyProject
2026-07-30 22:33:32,215 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: MacBook-Air-Anatoliy.local FullName: localhost
2026-07-30 22:33:32,226 INFO o.a.j.s.FileServer: Default base='/Users/anatoliy/MyProject'
2026-07-30 22:33:32,227 INFO o.a.j.s.FileServer: Set new base='/Users/anatoliy/MyProject'
2026-07-30 22:33:32,357 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-07-30 22:33:32,384 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-07-30 22:33:32,386 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-07-30 22:33:32,389 INFO o.a.j.s.SaveService: Loading file: /Users/anatoliy/MyProject/test.jmx
2026-07-30 22:33:32,433 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-30 22:33:32,433 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-30 22:33:32,433 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-30 22:33:32,433 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-07-30 22:33:32,433 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-07-30 22:33:32,433 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-07-30 22:33:32,439 INFO o.a.j.JMeter: Creating summariser <summary>
2026-07-30 22:33:32,454 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-07-30 22:33:32,455 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-07-30 22:33:32,455 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-07-30 22:33:32,457 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-07-30 22:33:32,458 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-07-30 22:33:32,499 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2026-07-30 22:33:32,561 INFO o.a.j.JMeter: Running test (1785440012561)
2026-07-30 22:33:32,571 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group
2026-07-30 22:33:32,571 INFO o.a.j.e.StandardJMeterEngine: Starting 5 threads for group Thread Group.
2026-07-30 22:33:32,571 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-07-30 22:33:32,571 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=5 ramp-up=1 delayedStart=false
2026-07-30 22:33:32,575 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-07-30 22:33:32,575 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-07-30 22:33:32,575 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-1
2026-07-30 22:33:32,586 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = MacBook-Air-Anatoliy.local
2026-07-30 22:33:32,590 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-07-30 22:33:32,591 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-07-30 22:33:32,591 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-07-30 22:33:32,591 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-07-30 22:33:32,591 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-07-30 22:33:32,653 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2026-07-30 22:33:32,657 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2026-07-30 22:33:32,657 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2026-07-30 22:33:32,717 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2026-07-30 22:33:32,719 INFO o.a.j.u.SSLManager: KeyStore created OK
2026-07-30 22:33:32,719 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2026-07-30 22:33:32,777 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-2
2026-07-30 22:33:32,910 INFO o.a.j.r.Summariser: summary +      1 in 00:00:00 =    2.9/s Avg:   271 Min:   271 Max:   271 Err:     0 (0.00%) Active: 2 Started: 2 Finished: 0
2026-07-30 22:33:32,945 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-1
2026-07-30 22:33:32,945 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-1
2026-07-30 22:33:32,946 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-2
2026-07-30 22:33:32,946 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-2
2026-07-30 22:33:32,977 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-3
2026-07-30 22:33:33,157 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-3
2026-07-30 22:33:33,158 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-3
2026-07-30 22:33:33,177 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-4
2026-07-30 22:33:33,359 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-4
2026-07-30 22:33:33,359 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-4
2026-07-30 22:33:33,377 INFO o.a.j.t.JMeterThread: Thread started: Thread Group 1-5
2026-07-30 22:33:33,479 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group 1-5
2026-07-30 22:33:33,479 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group 1-5
2026-07-30 22:33:33,479 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2026-07-30 22:33:33,480 INFO o.a.j.r.Summariser: summary +     14 in 00:00:01 =   24.5/s Avg:    46 Min:    16 Max:   127 Err:     0 (0.00%) Active: 0 Started: 5 Finished: 5
2026-07-30 22:33:33,480 INFO o.a.j.r.Summariser: summary =     15 in 00:00:01 =   16.3/s Avg:    61 Min:    16 Max:   271 Err:     0 (0.00%)